#### FormUtils Members

---

|  |
| --- |
| FormUtils Class   Methods   See Also |

The  FormUtils  type exposes the following members.

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method Static member | CanBeDissolved | Validates that input contains one or more form elements or geom combinations containing form elements. |
| Public method Static member | DissolveForms(Document, ICollection ElementId ) | Dissolves a collection of form elements into their defining elements. |
| Public method Static member | DissolveForms(Document, ICollection ElementId , ICollection ElementId ) | Dissolves a collection of form elements into their defining elements. |

# See Also

FormUtils Class

Autodesk.Revit.DB Namespace